[
    {
        "id":"1",
        "title":"Design Dialogue, Fall 2023-24: Department of Architecture Successfully Hosts Final Year Thesis Jury",
        "postedAt":"MONDAY, FEBRUARY 12,2024",
        "status":"Upcoming",
        "register":"https://youtu.be/PMM8kpi6V70",
        "desc":"In a remarkable showcase of academic excellence and creative ingenuity, the Department of Architecture at the American International University-Bangladesh (AIUB) is delighted to announce the successful conclusion of the 'Final Year Thesis Jury.' This significant event unfolded over the course of January 23,24 and 25, 2024, featuring the excellent work of 33 talented graduating students.The event, as detailed on the official poster disseminated to academic bodies, provided a platform for students to present their projects and receive constructive feedback from esteemed jurors. The engagement and insightful critiques from the invited professionals added immense value to the students' educational experience at this critical juncture of their graduating semester.The event was graced by distinguished jurors, each contributing a unique perspective to the evaluation process. The invited jurors[ renowned academician and professional included: Architect Jalal Ahmad-(Ex-President of Institute of Architects Bangladesh and the Vice President of Commonwealth Association of Architects), Architect B.K.S. Inan, Managing Director - CAD LTD, Architect Ziaul Islam Associate Professor, University of Asia Pacific, Architect A.B.M. Mahbubul Malik Associate Professor, Ahsanullah University of Science and Technology,  Architect Dr. Catherin D. Gomes Associate Professor, BUET, Architect Mohammad Shoeb Bhuiya Assistant Professor, University of Asia Pacific, Architect Dewan Shamsul Arif, Principal Architect, Vista Architectural Consultant, Architect Bayejid Mahbub Khondker Principal Architect, Nakshabid, Architect Sujaul Islam Khan Assistant Professor, North South University, Architect Mohammad Mahmudul Islam Assistant Professor, University of Asia Pacific, Architect Md Sazzad Hossain Associate Professor, MIST, Architect Nabi Newaz Khan present General Secretary , Institute of Architects Bangladesh, Architect Nabanita Islam Associate Professor & Head, University of Asia Pacific and the Faculties of Architecture Department, AIUB.  The journey leading up to this momentous occasion was marked by unwavering dedication and hard work. The students poured their hearts and minds into their individual projects throughout the semester, guided by the expertise of studio mentors Associate Professor Ar. Ashik Vaskor Mannan and Assistant Professor Ar. Irfat Alam. Their creativity flourished under the nurturing wings of the Head, Ar. M. Arefeen Ibrahim, whose encouragement and support played a pivotal role in shaping these outstanding projects. The guidance and mentorship extended by the thesis supervisors added an extra layer of depth to the students' explorations and discoveries.The Department of Architecture extends heartfelt gratitude to all participants, including the students who showcased their exceptional projects, the faculty members, and the esteemed jurors who generously shared their expertise. The event not only celebrated the achievements of the graduating students but also reinforced the commitment of the department to maintaining the highest standards of architectural education in Bangladesh. The feedback and active participation not only enriched the educational experience of the students but also underscored the collaborative effort to maintain the quality of architectural education in Bangladesh.",
        "images":{
            "img1":"./../src/assets/images/design-dialogue-spring-01.jpg"
        }
        
    },
    {
        "id":"2",
        "title":"Alumni at AIUB - Internship clinic for FBA interns organized by OPA",
        "postedAt":"FRIDAY, FEBRUARY 16,2024",
        "status":"Upcoming",
        "desc":"On February 1, 2024, the Office of Placement and Alumni (OPA) conducted an Internship Clinic for the benefit of interns of Spring 2024 of the Faculty of Business Administration (FBA). The speaker on the occasion was Mr. Auhidul Islam, Country HR Lead, Godrej Household Products, Bangladesh. Mr. Islam is an alumnus of this university.In his deliberations, the speaker gave a briefing on career planning and professional development by drawing on his personal experiences. Mr. Islam emphasized the importance of setting career goals and how to go about achieving them. He also provided guidance on how new entrants into the job market can steer their way to professional success.The program was well attended, with the students asking various questions.Mr. R. Tareque Moudud FCMA, Director, OPA and his team welcomed the guest and the participants to the program.",
        "images":{
            "img1":"./../src/assets/images/internshipclinicforfbainternsorganizedbyopa0802202401.jpg"
        }
        
    },
    {
        "id":"3",
        "title":"Final of 8th Bangladesh Qualifying Rounds of the Philip C. Jessup Int. Law Moot Court held at AIUB",
        "postedAt":"FRIDAY, FEBRUARY 16,2024",
        "status":"Upcoming",
        "desc":"The closing ceremony and the final rounds of the 8th Bangladesh Qualifying Rounds of Philip C Jessup International Moot Court Competition, 2024 was held on Saturday, February 3, 2024, at the Auditorium of the American International University-Bangladesh (AIUB). This year’s qualifying round has experienced the highest number of participations with 32 universities competing directly and 8 universities attending with observer status.The Chief Guest of the closing program, Her Excellence Madam Justice Naima Haider highly appreciated the Jessup Bangladesh for organizing moot court competitions like this and expressed hope that the success stories of participants particularly female participants would continue throughout their professional life as well.The Pro-vice Chancellor of AIUB Prof. Dr. Md. Abdur Rahman, presided over the function. The Competition came to an end with Bangladesh University of Professionals (BUP) emerging as the champion and University of Chittagong as the runners-up. Because of his outstanding performance, Samin Yeasar Islam from Jahangirnagar University was recognized as the ‘Best Mooter’ of the competition. Brac University was awarded 'Best Memorial Award', while Bangabandhu Sheikh Mujibur Rahman Maritime University, Bangladesh was the recipient of the award as the ‘Best New Team’.Furthermore, Feni University and Barisal University honored the spirit of the competition through achieving the 'Spirit of the Jessup' award. This is to be noted that the best four teams of the advanced rounds Bangladesh University of Professionals, University of Chittagong, Brac University and East West University will proceed to compete in the White & Case International Rounds to be held in the United States between March 30 to April 6, 2024.His Lordship Mr. Justice Sheikh Hassan Arif, High Court Division, Supreme Court of Bangladesh and Mr. Justice Ruhul Quddus graced the closing event as the special guests. Mr. Christopher Howard, Resident Legal Advisor, OPDAT-US Department of Justice, and Prof. Dr. Taslima Monsoor, Advisor of AIUB Law were also present at the event. Mr. Nuran Chowdhury, Coordinator of ILSA Bangladesh Chapter, and Mr. Washik Muhammod Istiaq Ezaz, National Administrator of Jessup International Law Moot Court 2024-Bangladesh Qualifying Round, also delivered speeches during the closing event.",
        "images":{
            "img1":"./../src/assets/images/aiubracessc250124001.jpg"
        }
        
    },
    {
        "id":"4",
        "title":"8th Bangladesh Qualifying Rounds of the Philip C. Jessup International Law Moot Court Competition Commences at AIUB",
        "postedAt":"FRIDAY, FEBRUARY 16,2024",
        "status":"Upcoming",
        "desc":"The inauguration ceremony for the Eighth Bangladesh Qualifying Rounds of the Philip C. Jessup International Law Moot Court Competition, 2024 took place on Thursday, February 1, 2024, at the Auditorium of the American International University-Bangladesh (AIUB).Mr. Salman F Rahman, the honorable advisor to the Prime Minister of the country, graced the occasion as the chief guest, joined by Mr. Peter D Haas, the US Ambassador in Bangladesh, as the special guest. Ms. Nadia Anwar, Founder Member and Vice Chairman of the Board of Trustees, and Mr. Christopher Howard, Resident Legal Advisor, US Embassy, Dhaka, were also in present at the ceremony.In his speech, the honorable advisor expressed his expectations that competitions of this nature would kindle the interest and insight of young law students in tackling complex legal problems. He highlighted the competition as a breeding ground for nurturing and developing minds to handle real-life challenges within the evolving international legal order. Ambassador Peter Haas emphasized gender equality in all spheres of social life, recalling the success of female participants in previous Jessup Moot Court Competitions. Ms. Nadia Anwar extended her sincere gratitude to the dignitaries, the International Law Student Association (ILSA) Bangladesh Chapters, and Jessup Bangladesh for allowing AIUB to partner in this event. She commended the participants for their passion in pursuing legal knowledge and advocacy.The event also featured speeches by the National Administrator of Jessup Bangladesh, Mr. Washik Muhammad Istiaq Ezaz, and the Founding National Administrator of Jessup Bangladesh and ILSA Coordinator, Mr. Nuran Choudhury.Dr. Hasanul A Hasan, Founder Member, Board of Trustees, AIUB, Dr. Carmen Z Lamagna, Member, Board of Trustees, AIUB were also present on the occasion along with the Registrar, Proctor, faculty members, officials, students, participants of AIUB and other institutions,The Philip C. Jessup International Law Moot Court Competition, organized by the International Law Students Association, is recognized globally as the 'World Cup of Moot' involving over 850 law schools from almost 100 countries. The Bangladesh Qualifying Round, organized by Jessup Bangladesh in association with the US Department of Justice, Office of Overseas Prosecutorial Development Assistance and Training (DOJ/OPDAT), and International Law Students Association (ILSA), is hosted and sponsored by the American International University-Bangladesh (AIUB) this year. Hearth Bangladesh is another partner of this year's event. With over 150 participants from 40 universities, the Bangladesh Qualifying Round stands as the third largest in the world and the second largest in South Asia, underscoring the increasing commitment to the legal field in the country. The competition spanned three days, concluding on Saturday, 3 February 2024, across various venues within the AIUB campus.",
        "images":{
            "img1":"./../src/assets/images/aiubjessupday24001.jpg"
        }
        
    },
    {
        "id":"5",
        "title":"Signing of MoU between AIUB and APEX DMIT Ltd.",
        "postedAt":"FRIDAY, FEBRUARY 16,2024",
        "status":"Upcoming",
        "desc":"On January 31, 2024, AIUB signed a memorandum of understanding with APEX DMIT Ltd. at the campus. The document was signed by Ms. Ismat Jahan Lissa, General Manager, Head of HR and Admin of APEX DMIT Ltd. and Mr. R. Tareque Moudud FCMA , Director OPA , on behalf of their respective organizations.  Ms. Ismat Jahan Lissa is an alumna of this university.The prime focus of the MOU is to promote academia – corporate linkage for the benefit of the university’s students by providing them with internships, placements as well as opportunities for research. In addition to this, the company will make available case studies on different corporate topics which may be used as classroom material.The signing program, organized by OPA  was well attended , amongst others by the Directors of BBA and MBA programs Dr. Reznin Nahar and Dr. Faridul Alam respectively. Members of the faculty of Business Administration also attended the program.",
        "images":{
            "img1":"./../src/assets/images/aiubieeeserh24013101.jpg"
        }
        
    },
    {
        "id":"6",
        "title":"7th Death Anniversary of Mrs. Hasna Abedin, Founder and Former Chairperson, AIUB",
        "postedAt":"MONDAY, FEBRUARY 12,2024",
        "status":"Ongoing",
        "desc":"The 7th death anniversary of Mrs. Hasna Abedin, the Founder and Former Chairperson of the American International University-Bangladesh (AIUB), was observed on Sunday, February 11th. A Dua, Holy Quran recitation, and Milad Mahfil were organized by the AIUB family. The AIUB family remembered her contribution to the spread of higher education and sought blessings and forgiveness for her departed soul.",
        "images":{
            "img1":"./../src/assets/images/7thannhasnaabedin001.jpeg"
        }
        
    },
    {
        "id":"7",
        "title":"AIUB-IQAC participated in 2-day long training on Outcome Based Education",
        "postedAt":"MONDAY, FEBRUARY 12,2024",
        "status":"Ongoing",
        "desc":"The Institutional Quality Assurance Cell of AIUB has always been striving to ensure and enhance the quality of education through accreditation of undergraduate degrees. In this course, 3 faculty members, Prof Dr. Farheen Hassan (Director, AIUB-IQAC), Nazia Farhana (Assistant Prof. & Assessor, AIUB-IQAC) and Susmita Ghosh (Associate Professor &Assessor, AIUB-IQAC) from AIUB-IQAC participated in 2-day long training program (10-11 February 2024) on Outcome Based Education organized by Board of Accreditation for Engineering and Technical Education (BAETE) of the Institute of Engineers, Bangladesh (IEB).The whole training program was divided into a total of six sessions which were conducted by esteemed speakers from different reputed universities. The training session provided a comprehensive overview on Necessity of BAETE Accreditation, Curriculum design, Teaching-Learning, Delivery Activities and Assessment, Complex Engineering Problems and Activities, Continuous Quality Improvement and Outcome Based Accreditation. Not only that, but the program also equipped attendees with knowledge of skills to design curriculum and complex engineering problems by the involvement on hands on activities in the interaction session. The insights gained from the session will be instrumental in enhancing the quality and effectiveness of educational programs within the institution.",
        "images":{
            "img1":"./../src/assets/images/newsaiubiqac1202202403 (1).jpg"
        }
        
    },
   
   
    {
        "id":"8",
        "title":"Workshop titled 'How to Join as a Product Manager'",
        "postedAt":"MONDAY, FEBRUARY 12,2024",
        "status":"Past",
        "desc":"On December 10, 2023, AIUB Computer Club organized a comprehensive workshop titled 'How to Join as a Product Manager.' The event took place at 7:30 PM via Google Meet, featuring Mr. Saif Hasan, Lead Product Manager at weDevs and Former Assistant General Secretary, Media and Publication, AIUB Computer Club, as the distinguished speaker.The workshop delved into various aspects of product management and Mr. Saif shared valuable insights during the event. The keynotes and talks included understanding Product Management as he went through the basic concepts and interactions integral to product management. After that he pointed out key differences of Project Manager and Product Manager. The speaker drew a distinction between project management and product management, both in a general context and within the landscape of Bangladesh. Highlighting the responsibilities, Mr. Saif emphasized the time constraints for project managers, while product managers decide, set vision, and mission and provide support. He also shared insights on achieving success in product management, prioritizing handling business, tech, and UX teams being the orchestra and focal point, a concept illustrated by a Steve Jobs quote 'I play the orchestra, and you're a good musician.' Practical scenarios involving companies like Bikash and Nagad were also discussed, including tasks like making mockups, adding features, and collaborating with development and design teams.In between Abhijit Bhowmik, special assistant for the office of student affairs (OSA) and Associate professor of computer science at AIUB spoke a few words and shared his thoughts on demand of product management urging the participants to gather as much knowledge as possible from the workshop. Later, the speaker outlined the requirements for joining as a fresher, including qualities such as good taste, sense, and communication skills. The importance of extracting the best from people was also highlighted. The speaker elaborated on why companies hire product managers, highly rating the unique skillset they bring to the table. Aspiring product managers were encouraged to gain experience during university through projects, emphasizing the ease of transitioning careers with the right experience. The importance of SWOT analysis, comparison, and market analysis in product management was underscored. Mr. Saif concluded by stating the significance of workout and testing in the field of product management.The workshop was well-attended, generated attention, raising numerous questions for the speaker to address as the program progressed. Sumayea Khatun and Iftakhar Ahmed Chowdhury were thanked and sent farewell by Mr. Saif. Ms. Sumayea announced the conclusion of the session at 8:30 p.m., inspiring and armed with insightful knowledge on product development.",
        "images":{
            "img1":"./../src/assets/images/aiubw10dacc2401.jpg"
        }
        
    },
    {
        "id":"9",
        "title":"From Novice to Designer: Photoshop & Illustrator Essentials",
        "postedAt":"MONDAY, FEBRUARY 12,2024",
        "status":"Past",
        "desc":"On Wednesday, 6th December AIUB Computer Club arranged an online seminar on “From Novice to Designer: Photoshop & Illustrator Essentials” at 8.00PM via Google Meet. The seminar was conducted by Sayeed Hasan, UI/UX Designer, Kolpolok Limited (Former Assistant General Secretary, Design & Decoration, Aiub Computer Club).The seminar aimed to teach the basic tools and techniques of Photoshop and Illustrator. The presenter, Mr. Hasan, began the session by interacting with the audience to understand their interests in design. He then shared his career journey and provided some tips to the beginners. He also gave an overview of the fundamentals of graphic design. He motivated students to set goals and find their desired career path. Mr. Hasan also suggested attendees to design anything and search templates online for inspiration and skill enhancement. However, he advised not to use any free designs from Freepik for final designs, but mentioned those can be used as elements. After an engaging session, he covered the basics of Illustrator, including image quality and the differences between raster and vector images. In the meantime, Abhijit Bhowmik (Associate Professor of CSE at AIUB and Special Assistant, Office of Student Affairs) joined the meeting and gave a small talk on the importance of design and the demand of Product Design, UI/UX design in the current job market. Mr. Hasan then explained how to convert PNGs to vectors and the use of abstract images. Then he discussed the core concepts, like setting print sizes for posters, banners or other works. Moreover, Mr. Hasan shared color theories, which are essential for design and explained the use of RGB for digital and CMYK for print. Lastly, he spoke about font and logo design, two popular fields, and how students can develop and practice effectively. He gave some examples from his own font and logo designs.There was a Question-Answer session at the end between the attendees and speaker. Later, Mr. Mirza and Mr. Faysal thanked Mr. Sayeed Hasan for the wonderful session and concluded the workshop at 9:30pm. Overall, the workshop was very effective and helpful not only for designers but also for all the participants who’ve joined. The attendees highly appreciated the knowledge they gathered and thanked AIUB Computer Club for taking such initiatives everyone was waiting for.",
        "images":{
            "img1":"./../src/assets/images/novicedesignerphotoshopillustrator-essentials001202402.png"
        }
        
    },
    {
        "id":"10",
        "title":"Seminar on “Emerging Research Highlights in Power & Energy”",
        "postedAt":"SUNDAY, FEBRUARY 11,2024",
        "status":"Ongoing",
        "desc":"On Wednesday, 31st January 2024, the Department of EEE, Faculty of Engineering, AIUB, in collaboration with IEEE AIUB Student Branch successfully organized a seminar on “Emerging Research Highlights in Power & Energy”. The main goal of this session was to provide insights into the current developments in the power and energy sector while also motivating participants to engage in further research on this topic, particularly focusing on renewable energy.The event was inaugurated with a warm welcoming elocution of Prof. Dr. ABM Siddique Hossain, Dean, Faculty of Engineering, AIUB; Advisor, IEEE AIUB Student Branch. He engaged in a comprehensive discussion on global issues pertaining to power and energy, underscoring their significance. Then, the floor was taken by the esteemed speaker of the session Dr. Rabiul Islam, Senior Lecturer, University of Wollongong, Australia. The speaker emphasized the significance of research in advancing knowledge and resolving real-world challenges. He offered practical guidance for aspiring researchers by sharing insights into the recruitment process for research positions in companies. Dr. Islam discussed the rapidly evolving landscape of electric vehicles and urged a focus on fostering the skills of future engineers to cater to the growing demand in this sector. He also highlighted the challenges related to charging electric vehicles and proposed a new concept of universal charging stations. He emphasized the importance of problem-solving in engineering and discussed achieving 100% renewable energy utilization, including grid-connected systems, solar panel planning, offshore winds, wind turbine installation, and direct grid integration. He discussed ocean wave energy, new generators, solar panel costs, economic challenges in renewable energy, and power grid surveillance. He encouraged a research mindset and shared his experiences. In the Q&A session, he enthusiastically answered all the queries.Following the Q&A session, Prof. Dr. Mohammad Abdul Mannan, Associate Dean, Faculty of Engineering, AIUB; Advisor, IEEE AIUB Student Branch, took the floor to share his insights as the concluding remarks of the session where he highlighted the speaker's credentials and discussed potential study opportunities in Australia. Dr. M Abdur Razzak, Professor, Department of EEE, IUB; SMIEEE, Fellow JSPS, Fellow IEB, attended the seminar as the honorable guest. His presence added further prestige to the occasion, while contributing to the intellectual atmosphere of the gathering.The seminar successfully educated participants about power and energy, motivating them to conduct further research and generate innovative solutions. It highlighted the practical use of renewable energy, aligning with SDG 7 (Affordable and Clean Energy). Additionally, it emphasized reducing carbon emissions and provided perspectives on the power and energy sector, corresponding to SDG 9 (Industry, Innovation, and Infrastructure) and SDG 13 (Climate Action), respectively.The session began at 2:00 PM and ended at 4:00 PM. A total of 80+ participants attended the webinar. Honorable faculty members Mr. Nafiz Ahmed Chisty, Associate Professor & Department Head, Undergraduate Program; Advisor; IEEE AIUB Student Branch; Mr. Chowdhury Akram Hossain, Department Head, Computer Engineering (CoE),  Special Assistant, Office of Student Affairs (OSA), AIUB; Advisor, IEEE AIUB Student Branch; Dr. Rifat Hazari, Senior Assistant Professor,EEE,; Deputy Director, Dr. Anwarul Abedin Institute of Innovation; Mr. Bishwajit Banik Pathik, Assistant Professor,EEE; Dr. Gour Chand Mazumder, Assistant Professor, EEE; Mr. Tamim Hossain, Lecturer, EEE,; Mr. Md. Shahariar Parvez, Lecturer, CoE, were present among the participants.",
        "images":{
            "img1":"./../src/assets/images/aiubieeeserh24013101.jpg"
        }
        
    },
    {
        "id":"11",
        "title":"Celebration of Capstone Project Completion: Fall 2023-24",
        "postedAt":"SUNDAY, FEBRUARY 11,2024",
        "status":"Ongoing",
        "desc":"On January 25, 2024, AIUB Community of Engineering Students (ACES) organized the “Celebration of Capstone Project Completion” program for the Fall 2023-24 semester, which was supported by the Faculty of Engineering at AIUB. This event took place in the Multipurpose Hall of Building D at American International University-Bangladesh (AIUB). A total of 33 groups presented their capstone projects in front of their respective supervisors, externals, and other faculty members. After the successful completion of the defenses, all groups engaged in the poster competition. The poster presentations were followed by an enchanting cultural program performed by the AIUB Performing Arts Club (APAC). The program was graced by the presence of industrial judges, who evaluated all the posters and provided their valuable insights.Prof. Dr. A. B. M. Siddique Hossain (Professor, Dean, Faculty of Engineering, AIUB) inaugurated the event and congratulated the students on successfully completing the Capstone Projects. Then, all the participants were shown appreciation for their hard work through a wonderful video. Afterward, Prof. Dr. Md. Abdul Mannan (Professor, Associate Dean, Faculty of Engineering, AIUB) and Dr. Md. Saniat Rahman Zishan (Associate Professor, Director, Faculty of Engineering, and AIUB) showed gratitude towards the honorable industrial judges, who evaluated the capstone project posters, by giving them tokens of appreciation from AIUB. The honorable judges who were present during the event are Mr. Mohammad Ahsanuzzaman (Manager, Sales, Akij Biax Films Limited ), Mr. Sangram Das (Assistant Manager, Strategic Product Development Division, Renata Limited), Mr. Tonmoy Chakraborty (Project Director, South Asia Cloud Business, Huawei Technologies), Ms. Setu Saha (Technical Specialist-MWS, Microsoft Bangladesh), Engr. Mustafa Rabiul Hassan (Deputy Manager Electrical & Automation, GPH Ispat Ltd), Mr. MD Riyal Morshad (Senior Service Engineer, MAN Energy Solutions Ltd), Engr. Jahangir Alam (Manager (Technical), DYSIN International Ltd), Mr. Abdullah Al Maruf (Manager, Project Sales, Cross-world Power Limited), Ms. Farzana Afrin Tisha (Head of Cloud Business, Brain Station 23 Ltd), Engr. Md. Zahidul Islam (Senior Electrical Engineer, SAMSUNG C & T), Mr. Md. Rakibul Hassan (HSE Specialist, Chevron Bangladesh).Dr. Md. Abdul Mannan, Dr. Md. Saniat Rahman Zishan , Mr. Nafiz Ahmed Chisty (Associate Professor, Head-In Charge [Undergraduate Program, EEE], Faculty of Engineering, AIUB), Dr. Mohammad Nasir Uddin (Senior Associate Professor, Head [Graduate Program], Faculty of Engineering, AIUB) and Dr. Md. Ehasanul Haque (Senior Assistant Professor, Department Head [IPE], Faculty of Engineering,  AIUB) presented the certificates of acknowledgment to the top three groups in the Poster Competition.  Finally, Dr. Md. Saniat Rahman Zishan announced the names of the three groups who are nominated for the Vice Chancellor’s Award.The noteworthy program came to an end with a group photo. The entire program was a huge success due to the tremendous support from the Capstone Project Supervisors of the EEE, CoE and IPE departments.",
        "images":{
            "img1":"./../src/assets/images/aiubracessc250124001.jpg"
        }
        
    }
]